Paciente8159/uCNC/makefiles/stm32f401/stm32f401.c
#pragma weak NMI_Handler = Default_Handler
#pragma weak MemManage_Handler = Default_Handler
#pragma weak BusFault_Handler = Default_Handler
#pragma weak UsageFault_Handler = Default_Handler
#pragma weak SVC_Handler = Default_Handler
#pragma weak DebugMon_Handler = Default_Handler
#pragma weak PendSV_Handler = Default_Handler
#pragma weak SysTick_Handler = Default_Handler
#pragma weak WWDG_Handler = Default_Handler               /*!< Window WatchDog Interrupt                                         */
#pragma weak PVD_Handler = Default_Handler                /*!< PVD through EXTI Line detection Interrupt                         */
#pragma weak TAMP_STAMP_Handler = Default_Handler         /*!< Tamper and TimeStamp interrupts through the EXTI line             */
#pragma weak RTC_WKUP_Handler = Default_Handler           /*!< RTC Wakeup interrupt through the EXTI line                        */
#pragma weak FLASH_Handler = Default_Handler              /*!< FLASH global Interrupt                                            */
#pragma weak RCC_Handler = Default_Handler                /*!< RCC global Interrupt                                              */
#pragma weak EXTI0_Handler = Default_Handler              /*!< EXTI Line0 Interrupt                                              */
#pragma weak EXTI1_Handler = Default_Handler              /*!< EXTI Line1 Interrupt                                              */
#pragma weak EXTI2_Handler = Default_Handler              /*!< EXTI Line2 Interrupt                                              */
#pragma weak EXTI3_Handler = Default_Handler              /*!< EXTI Line3 Interrupt                                              */
#pragma weak EXTI4_Handler = Default_Handler              /*!< EXTI Line4 Interrupt                                              */
#pragma weak DMA1_Stream0_Handler = Default_Handler       /*!< DMA1 Stream 0 global Interrupt                                    */
#pragma weak DMA1_Stream1_Handler = Default_Handler       /*!< DMA1 Stream 1 global Interrupt                                    */
#pragma weak DMA1_Stream2_Handler = Default_Handler       /*!< DMA1 Stream 2 global Interrupt                                    */
#pragma weak DMA1_Stream3_Handler = Default_Handler       /*!< DMA1 Stream 3 global Interrupt                                    */
#pragma weak DMA1_Stream4_Handler = Default_Handler       /*!< DMA1 Stream 4 global Interrupt                                    */
#pragma weak DMA1_Stream5_Handler = Default_Handler       /*!< DMA1 Stream 5 global Interrupt                                    */
#pragma weak DMA1_Stream6_Handler = Default_Handler       /*!< DMA1 Stream 6 global Interrupt                                    */
#pragma weak ADC_Handler = Default_Handler                /*!< ADC1, ADC2 and ADC3 global Interrupts                             */
#pragma weak CAN1_TX_Handler = Default_Handler            /*!< CAN1 TX Interrupt                                                 */
#pragma weak CAN1_RX0_Handler = Default_Handler           /*!< CAN1 RX0 Interrupt                                                */
#pragma weak CAN1_RX1_Handler = Default_Handler           /*!< CAN1 RX1 Interrupt                                                */
#pragma weak CAN1_SCE_Handler = Default_Handler           /*!< CAN1 SCE Interrupt                                                */
#pragma weak EXTI9_5_Handler = Default_Handler            /*!< External Line[9:5] Interrupts                                     */
#pragma weak TIM1_BRK_TIM9_Handler = Default_Handler      /*!< TIM1 Break interrupt and TIM9 global interrupt                    */
#pragma weak TIM1_UP_TIM10_Handler = Default_Handler      /*!< TIM1 Update Interrupt and TIM10 global interrupt                  */
#pragma weak TIM1_TRG_COM_TIM11_Handler = Default_Handler /*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
#pragma weak TIM1_CC_Handler = Default_Handler            /*!< TIM1 Capture Compare Interrupt                                    */
#pragma weak TIM2_Handler = Default_Handler               /*!< TIM2 global Interrupt                                             */
#pragma weak TIM3_Handler = Default_Handler               /*!< TIM3 global Interrupt                                             */
#pragma weak TIM4_Handler = Default_Handler               /*!< TIM4 global Interrupt                                             */
#pragma weak I2C1_EV_Handler = Default_Handler            /*!< I2C1 Event Interrupt                                              */
#pragma weak I2C1_ER_Handler = Default_Handler            /*!< I2C1 Error Interrupt                                              */
#pragma weak I2C2_EV_Handler = Default_Handler            /*!< I2C2 Event Interrupt                                              */
#pragma weak I2C2_ER_Handler = Default_Handler            /*!< I2C2 Error Interrupt                                              */
#pragma weak SPI1_Handler = Default_Handler               /*!< SPI1 global Interrupt                                             */
#pragma weak SPI2_Handler = Default_Handler               /*!< SPI2 global Interrupt                                             */
#pragma weak USART1_Handler = Default_Handler             /*!< USART1 global Interrupt                                           */
#pragma weak USART2_Handler = Default_Handler             /*!< USART2 global Interrupt                                           */
#pragma weak USART3_Handler = Default_Handler             /*!< USART3 global Interrupt                                           */
#pragma weak EXTI15_10_Handler = Default_Handler          /*!< External Line[15:10] Interrupts                                   */
#pragma weak RTC_Alarm_Handler = Default_Handler          /*!< RTC Alarm (A and B) through EXTI Line Interrupt                   */
#pragma weak OTG_FS_WKUP_Handler = Default_Handler        /*!< USB OTG FS Wakeup through EXTI line interrupt                     */
#pragma weak TIM8_BRK_TIM12_Handler = Default_Handler     /*!< TIM8 Break Interrupt and TIM12 global interrupt                   */
#pragma weak TIM8_UP_TIM13_Handler = Default_Handler      /*!< TIM8 Update Interrupt and TIM13 global interrupt                  */
#pragma weak TIM8_TRG_COM_TIM14_Handler = Default_Handler /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
#pragma weak TIM8_CC_Handler = Default_Handler            /*!< TIM8 Capture Compare global interrupt                             */
#pragma weak DMA1_Stream7_Handler = Default_Handler       /*!< DMA1 Stream7 Interrupt                                            */
#pragma weak FMC_Handler = Default_Handler                /*!< FMC global Interrupt                                              */
#pragma weak SDIO_Handler = Default_Handler               /*!< SDIO global Interrupt                                             */
#pragma weak TIM5_Handler = Default_Handler               /*!< TIM5 global Interrupt                                             */
#pragma weak SPI3_Handler = Default_Handler               /*!< SPI3 global Interrupt                                             */
#pragma weak UART4_Handler = Default_Handler              /*!< UART4 global Interrupt                                            */
#pragma weak UART5_Handler = Default_Handler              /*!< UART5 global Interrupt                                            */
#pragma weak TIM6_DAC_Handler = Default_Handler           /*!< TIM6 global and DAC1&2 underrun error  interrupts                 */
#pragma weak TIM7_Handler = Default_Handler               /*!< TIM7 global interrupt                                             */
#pragma weak DMA2_Stream0_Handler = Default_Handler       /*!< DMA2 Stream 0 global Interrupt                                    */
#pragma weak DMA2_Stream1_Handler = Default_Handler       /*!< DMA2 Stream 1 global Interrupt                                    */
#pragma weak DMA2_Stream2_Handler = Default_Handler       /*!< DMA2 Stream 2 global Interrupt                                    */
#pragma weak DMA2_Stream3_Handler = Default_Handler       /*!< DMA2 Stream 3 global Interrupt                                    */
#pragma weak DMA2_Stream4_Handler = Default_Handler       /*!< DMA2 Stream 4 global Interrupt                                    */
#pragma weak ETH_Handler = Default_Handler                /*!< Ethernet global Interrupt                                         */
#pragma weak ETH_WKUP_Handler = Default_Handler           /*!< Ethernet Wakeup through EXTI line Interrupt                       */
#pragma weak CAN2_TX_Handler = Default_Handler            /*!< CAN2 TX Interrupt                                                 */
#pragma weak CAN2_RX0_Handler = Default_Handler           /*!< CAN2 RX0 Interrupt                                                */
#pragma weak CAN2_RX1_Handler = Default_Handler           /*!< CAN2 RX1 Interrupt                                                */
#pragma weak CAN2_SCE_Handler = Default_Handler           /*!< CAN2 SCE Interrupt                                                */
#pragma weak OTG_FS_Handler = Default_Handler             /*!< USB OTG FS global Interrupt                                       */
#pragma weak DMA2_Stream5_Handler = Default_Handler       /*!< DMA2 Stream 5 global interrupt                                    */
#pragma weak DMA2_Stream6_Handler = Default_Handler       /*!< DMA2 Stream 6 global interrupt                                    */
#pragma weak DMA2_Stream7_Handler = Default_Handler       /*!< DMA2 Stream 7 global interrupt                                    */
#pragma weak USART6_Handler = Default_Handler             /*!< USART6 global interrupt                                           */
#pragma weak I2C3_EV_Handler = Default_Handler            /*!< I2C3 event interrupt                                              */
#pragma weak I2C3_ER_Handler = Default_Handler            /*!< I2C3 error interrupt                                              */
#pragma weak OTG_HS_EP1_OUT_Handler = Default_Handler     /*!< USB OTG HS End Point 1 Out global interrupt                       */
#pragma weak OTG_HS_EP1_IN_Handler = Default_Handler      /*!< USB OTG HS End Point 1 In global interrupt                        */
#pragma weak OTG_HS_WKUP_Handler = Default_Handler        /*!< USB OTG HS Wakeup through EXTI interrupt                          */
#pragma weak OTG_HS_Handler = Default_Handler             /*!< USB OTG HS global interrupt                                       */
#pragma weak DCMI_Handler = Default_Handler               /*!< DCMI global interrupt                                             */
#pragma weak CRYP_Handler = Default_Handler               /*!< CRYP crypto global interrupt                                      */
#pragma weak HASH_RNG_Handler = Default_Handler           /*!< Hash and Rng global interrupt                                     */
#pragma weak FPU_Handler = Default_Handler                /*!< FPU global interrupt                                              */
#pragma weak UART7_Handler = Default_Handler              /*!< UART7 global interrupt                                            */
#pragma weak UART8_Handler = Default_Handler              /*!< UART8 global interrupt                                            */
#pragma weak SPI4_Handler = Default_Handler               /*!< SPI4 global Interrupt                                             */
#pragma weak SPI5_Handler = Default_Handler               /*!< SPI5 global Interrupt                                             */
#pragma weak SPI6_Handler = Default_Handler               /*!< SPI6 global Interrupt                                             */
#pragma weak SAI1_Handler = Default_Handler               /*!< SAI1 global Interrupt                                             */
#pragma weak LTDC_Handler = Default_Handler               /*!< LTDC global Interrupt                                              */
#pragma weak LTDC_ER_Handler = Default_Handler            /*!< LTDC Error global Interrupt                                        */
#pragma weak DMA2D_Handler = Default_Handler              /*!< DMA2D global Interrupt                                            */
#pragma weak QUADSPI_Handler = Default_Handler            /*!< QUADSPI global Interrupt                                          */
#pragma weak DSI_Handler = Default_Handler                /*!< DSI global Interrupt                                              */

void Default_Handler(void)
{
    while (1)
    {
    }
}